<?php

namespace Database\Seeders;

use App\Models\Courses;
use App\Models\Modules;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CoursesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Courses::create([
            'module_id' => 1,
            'name' => 'Започни Свој Бизнис: Од Идеја до Реализација',
            'description' => 'Овој курс ги покрива основите на започнување сопствен бизнис, вклучувајќи истражување на пазарот,
             развој на бизнис план и поставување на правна структура',
        ]);      

        Courses::create([
            'module_id' => 1,
            'name' => 'Финансиска Независност: Управување со Личните Финансии за Претприемачи',
            'description' => 'Курс насочен кон финансиско планирање и управување со лични средства за претприемачи, со фокус на буџетирање, инвестирање и оптимизирање на готовинскиот тек.',
        ]); 

        Courses::create([
            'module_id' => 1,
            'name' => 'Маркетинг и Брендирање за Мали Бизниси',
            'description' => 'Овој курс ги учи основите на создавање ефективни маркетинг стратегии и развивање на уникатен бренд за мали и средни бизниси.',
        ]);      

        Courses::create([
            'module_id' => 1,
            'name' => 'Дигитални Стратегии за Раст на Твојот Бизнис',
            'description' => 'Овој курс покрива дигитални алатки и стратегии за раст на персонален бизнис преку онлајн канали, вклучувајќи социјални медиуми, SEO, и е-трговија',
        ]); 

        Courses::create([
            'module_id' => 2,
            'name' => 'Стратешко Управување: Како да водите успешен бизнис',
            'description' => 'Овој курс се фокусира на развој и имплементација на стратешки планови за долгорочен раст и конкурентност на пазарот',
        ]);

        Courses::create([
            'module_id' => 2,
            'name' => 'Финансиско управување за лидери: Донесување паметни одлуки',
            'description' => 'Ќе научите како да ја разберете динамиката на финансиското управување и како да носите финансиски одлуки базирани на анализа',
        ]); 

        Courses::create([
            'module_id' => 2,
            'name' => 'Бизнис Развој: Од иновација до меѓународен раст',
            'description' => 'Во овој курс ќе ги откриете процесите на иновација, развој на нови производи и проширување на вашиот бизнис на глобално ниво',
        ]);      
        
        Courses::create([
            'module_id' => 2,
            'name' => 'Претприемништво и Лидерство: Градење бизнис од нула',
            'description' => 'Во овој курс ќе научите како да започнете и водите бизнис со јасна визија и силни лидерски вештини',
        ]);      
    
    }
}