<?php

namespace Database\Seeders;

use App\Models\LectureBody;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class LectureBodySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Вештини за преговарање: Како да го постигнете најдоброто за вашиот бизнис',
            "content" => 'Преговарањето е клучен дел од секој бизнис процес. Добро поставените преговори 
            можат да доведат до подобри услови, поголеми профити и силни партнерства. За да успеете во ова, 
            потребни се комуникациски вештини, подготвеност и разбирање на потребите на двете страни. 
            Стратегијата што ќе ја примените може да биде клучна за успехот на вашиот бизнис.

.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Лидерство во кризни ситуации: Како да управувате со несигурност',
            "content" => 'Кога бизнисот се соочува со предизвици, лидерството доаѓа до израз. 
            Успешните лидери знаат како да останат смирени, брзо да донесуваат одлуки и да ги 
            мотивираат своите тимови во време на криза. Управувањето со ризици и адаптирањето 
            на стратегиите во текот на непредвидливи околности се од витално значење за 
            долгорочниот успех на компанијата.

.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Иновации и раст: Како да го водите бизнисот напред',
            "content" => 'Во денешниот динамичен свет, иновациите се неопходни за 
            раст и конкурентност на пазарот. Развивањето нови идеи, прифаќањето на 
            технолошките напредоци и оптимизирањето на процесите може значително да 
            го подобрат вашиот бизнис. Инвестицијата во иновации не само што ја 
            зголемува ефикасноста, туку и ја отвора вратата кон нови пазари и можности.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Управување со време: Како да бидете продуктивни и ефективни',
            "content" => 'Времето е еден од највредните ресурси во секој бизнис. Ефективното управување 
            со време овозможува подобра продуктивност и постигнување на целите во кратки рокови. 
            Со правилно планирање и поставување приоритети, можете да избегнете стрес и да се 
            фокусирате на најважните активности кои ќе го придвижат бизнисот напред.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Финансиско планирање: Тајните на одржливиот раст',
            "content" => 'Финансиското планирање е основата за стабилен и одржлив бизнис раст. 
            Управувањето со паричните текови, контролата на трошоците и поставувањето на јасни 
            финансиски цели овозможуваат бизнисот да остане стабилен и конкурентен на пазарот. 
            Со добра финансиска стратегија, можете да ја намалите несигурноста и да ги искористите 
            можностите за инвестирање.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Креативност во бизнисот: Како иновативните идеи го трансформираат пазарот',
            "content" => 'Креативноста е двигател на иновациите и клучен фактор за одржување на 
            конкурентска предност. Компаниите кои промовираат култура на креативност често наоѓаат 
            нови начини за решавање на проблемите и создавање на уникатни производи и услуги. 
            Поттикнувањето на вработените да размислуваат „надвор од кутијата“ може да отвори нови 
            можности и да го зајакне вашиот бизнис.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Градење на силен тим: Клуч за успех на компанијата',
            "content" => 'Ниту еден бизнис не може да успее без посветен и добро организиран тим. 
            Вработувањето на вистинските луѓе, нивната мотивација и континуираниот развој се од 
            клучно значење за продуктивноста и успехот. Ефективните лидери знаат дека градењето 
            силни односи и доверба во тимот води до повисоки резултати и помал тек на кадри.
'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Маркетинг стратегии: Како да се издвоите од конкуренцијата',
            "content" => 'Во пренатрупаниот пазар, важно е да имате силна маркетинг стратегија 
            која ќе го истакне вашиот бренд. Разбирањето на потребите на потрошувачите, создавањето 
            релевантни пораки и користењето на соодветните канали за комуникација може значително 
            да го зголеми вашиот досег и да ја зајакне лојалноста кон брендот.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Ризик и награда: Како правилното управување со ризикот води до успех',
            "content" => 'Секој бизнис вклучува ризик, но успешните претприемачи знаат како да го 
            менаџираат ризикот за да го минимизираат неговото влијание и да ги искористат можностите 
            што произлегуваат од него. Планирањето, истражувањето и развивањето на сценарија за 
            непредвидени ситуации ќе ви помогнат да се справите со ризиците на начин што ќе ги зголеми 
            шансите за успех.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Корисничко искуство: Како да ги задржите клиентите',
            "content" => 'Корисничкото искуство е важен фактор кој го одредува 
            успехот на вашиот бизнис. Задоволните клиенти се најдобрите амбасадори 
            на вашиот бренд и го зголемуваат вашиот пазарен удел преку препораки. 
            Инвестирањето во подобрување на услугата, слушањето на фидбек и брзата 
            реакција на проблеми може да помогне во градењето на долгорочни односи со клиентите.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Менаџирање на промени: Како да го адаптирате вашиот бизнис',
            "content" => 'Промените се неизбежни во секој бизнис. Способноста на организацијата 
            да се адаптира на нови технологии, регулативи или пазари може да одлучи дали ќе успее 
            или ќе пропадне. Менаџирањето на промените вклучува проактивно лидерство, поддршка на 
            тимот и правилно поставување на очекувањата за да се осигури мазна транзиција.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Бренд идентитет: Како да изградите силен и препознатлив бренд',
            "content" => 'Брендот е многу повеќе од лого или слоган — тоа е перцепцијата што клиентите 
            ја имаат за вашиот бизнис. Создавањето силен и конзистентен бренд идентитет може да ви 
            помогне да се издвоите од конкуренцијата и да создадете лојална база на потрошувачи. Ова 
            бара кохерентна комуникација, јасни вредности и постојана грижа за тоа како вашиот бренд 
            се перципира на пазарот.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Етика во бизнисот: Зошто транспарентноста е важна',
            "content" => 'Етичкото управување со бизнисот е од суштинско значење за долгорочен успех. 
            Компаниите кои покажуваат интегритет и транспарентност во своите деловни активности создаваат 
            доверба кај своите клиенти, партнери и вработени. Почитувањето на етичките 
            стандарди не само што го зајакнува брендот, туку исто така го намалува ризикот од правни и 
            репутациски проблеми.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Дигитална трансформација: Како технологијата го менува бизнисот',
            "content" => 'Дигиталната трансформација го редефинира начинот на кој функционираат бизнисите. 
            Од автоматизација на процесите до користење на податоци за донесување информирани одлуки, 
            технологијата нуди нови можности за зголемување на ефикасноста и конкурентноста. Бизнисите кои 
            ги прифаќаат технолошките промени се поподготвени за идни предизвици и можности.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Стратешко размислување: Како да го планирате успехот',
            "content" => 'Во денешниот динамичен свет, иновациите се неопходни за 
            раст и конкурентност на пазарот. Развивањето нови идеи, прифаќањето на 
            технолошките напредоци и оптимизирањето на процесите може значително да 
            го подобрат вашиот бизнис. Инвестицијата во иновации не само што ја 
            зголемува ефикасноста, туку и ја отвора вратата кон нови пазари и можности.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Долгорочна визија: Како да го планирате растот на вашиот бизнис',
            "content" => 'Успешните компании не размислуваат само за денес, туку и за иднината. 
            Долгорочната визија им овозможува на бизнисите да поставуваат јасни цели и да работат 
            кон нив со стратегиски план. Овој пристап ви овозможува да се подготвите за 
            предизвиците што следат и да ги користите можностите за постигнување континуиран раст.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Менторство и развој на талент: Како да ги инспирирате идните лидери',
            "content" => 'Развојот на таленти е еден од најважните аспекти на растот на компанијата. 
            Водечките бизниси инвестираат во менторски програми и обуки кои им помагаат на вработените 
            да ги развијат своите вештини и лидерски способности. Преку поддршка и охрабрување, 
            компаниите создаваат силни лидери кои ќе го продолжат успехот на организацијата.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Корпоративна култура: Како да создадете позитивна работна средина',
            "content" => 'Корпоративната култура е една од најважните компоненти за успехот на компанијата. 
            Силната, позитивна култура го поттикнува ангажманот на вработените, го намалува текот на кадри и 
            создава мотивирана работна средина. Компаниите кои вложуваат во својата култура, промовираат тимска 
            работа, транспарентност и етика, привлекуваат и задржуваат таленти и постигнуваат повисоки нивоа на 
            продуктивност.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Донесување одлуки под притисок: Како да останете фокусирани',
            "content" => 'Во светот на бизнисот, секојдневно се соочувате со потреба од брзо 
            донесување на одлуки, често под притисок. Способноста да останете смирени и да ги 
            анализирате ситуациите рационално може да значи разлика помеѓу успех и неуспех. Клучно 
            е да ги процените опциите, да ги поставите приоритетите и да верувате во вашите 
            инстинкти за да донесете најдобрата можна одлука.'
        ]);

        LectureBody::create([
            'lecture_id' => 1,
            'subtitle' => 'Меѓународен бизнис: Како да се проширите на глобалниот пазар',
            "content" => 'Ширењето на глобалниот пазар може да биде клучен чекор за раст 
            на вашиот бизнис. Разбирањето на различните култури, регулативи и економски 
            услови ќе ви помогне да се прилагодите и успешно да навлезете на нови пазари. 
            Стратегиите за глобализација бараат претпазливо планирање и силна мрежа од партнери 
            за да го максимизирате вашиот успех.'
        ]);

    }
}
