<?php

namespace Database\Seeders;

use App\Models\LecturePreview;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class LecturePreviewSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Евиденцијата на приходите и на расходите претставува
            основа за управување со финансии и домаќинство.
            Водењето на буџетот ни овозможува да ја согледаме реалната состојба
            на своите финансии и да ги распределиме парите што
            ги имаме во согласност со приоритетите.',
            'learn_points' => json_encode([
                'Да управувате со личните финансии',
                'Да ги следите вашите трошоци',
                'Важни факти за финансиите'
            ]),
            'fun_fact' => 'Дали знаете дека 70% од стресот што го чувствуваме е
             предизвикан од финансиски грижи. (Психологија на успехот, Дејл Карнеги).',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Планирањето на финансискиот буџет помага во одржувањето
            на стабилноста на вашите финансии. Со добро планирање, може да
            избегнете непотребни трошоци.',
            'learn_points' => json_encode([
                'Како да планирате буџет',
                'Како да ги контролирате трошоците',
                'Важноста на штедењето'
            ]),
            'fun_fact' => 'Истражувањата покажуваат дека само 39% од луѓето прават
            финансиски план за иднината.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Дисциплината при штедењето е клучна за финансиска слобода.
            Секое мало штедење се претвора во голема сума низ време.',
            'learn_points' => json_encode([
                'Предности на штедењето',
                'Како да се постави штеден план',
                'Разликата помеѓу краткорочно и долгорочно штедење'
            ]),
            'fun_fact' => 'Според статистиките, луѓето кои штедат редовно имаат
            поголема финансиска безбедност во споредба со оние што не штедат.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Инвестирањето во знаење е еден од најдобрите начини да ги
            зголемите своите финансиски средства на долг рок.',
            'learn_points' => json_encode([
                'Зошто е важно да се инвестира во себе',
                'Како да ги препознаете добрите инвестиции',
                'Финансиски инструменти за долгорочни цели'
            ]),
            'fun_fact' => 'Алберт Ајнштајн ја нарекол сложената камата осмото
            светско чудо поради нејзината моќ за долгорочно зголемување на богатството.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Кредитната карта може да биде корисна алатка за
            финансиско управување, но исто така носи и ризици доколку не се користи правилно.',
            'learn_points' => json_encode([
                'Како правилно да користите кредитна карта',
                'Што да избегнувате со кредитните картички',
                'Како каматата влијае врз долговите'
            ]),
            'fun_fact' => 'Истражувања покажуваат дека луѓето трошат 15-20%
            повеќе кога користат кредитни картички во споредба со кеш.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Диверзификацијата на инвестициите е клуч
            за намалување на ризикот. Не ставајте ги сите јајца во иста кошница.',
            'learn_points' => json_encode([
                'Што значи диверзификација',
                'Предности на различни типови инвестиции',
                'Како да балансирате помеѓу ризик и принос'
            ]),
            'fun_fact' => 'Легендарниот инвеститор Ворен Бафет вели дека
            „Најдобриот начин да ги намалите ризиците е да инвестирате во повеќе различни места“.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Финансиското планирање за пензија е клучно за
            стабилна иднина. Колку порано започнете, толку поудобна ќе биде вашата пензија.',
            'learn_points' => json_encode([
                'Зошто треба да започнете со штедење за пензија рано',
                'Кои пензиски фондови се најдобри за вас',
                'Како да ја пресметате потребната сума за пензија'
            ]),
            'fun_fact' => 'Истражувањата покажуваат дека луѓето кои штедат
            за пензија од рана возраст имаат значително повеќе средства во пензионерските години.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Здравото финансиско однесување вклучува контролирање
            на импулсивните купувања и донесување осмислени одлуки при трошење.',
            'learn_points' => json_encode([
                'Како да избегнете импулсивни купувања',
                'Како да ја контролирате желбата за трошење',
                'Кои се долгорочните последици на неразумно трошење'
            ]),
            'fun_fact' => 'Според истражувања, луѓето се повеќе склони на
            импулсивни купувања кога се под стрес или уморни.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Трошоците за живот може драстично да варираат од
            еден регион до друг. Познавањето на реалните трошоци ќе ви помогне
            да го планирате својот буџет соодветно.',
            'learn_points' => json_encode([
                'Како да ги пресметате вашите месечни трошоци',
                'Што е инфлација и како влијае врз вашиот животен стандард',
                'Како да ги минимизирате непотребните трошоци'
            ]),
            'fun_fact' => 'Во различни делови на светот, просечните трошоци за
            живот варираат за повеќе од 100%, според глобалните статистики.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Финансиското образование е важен елемент во личниот
            и професионален успех. Луѓето со високо финансиско образование
            имаат поголема шанса да остварат успешна кариера.',
            'learn_points' => json_encode([
                'Основи на финансиското образование',
                'Зошто финансиското знаење е моќ',
                'Како да ги надградите вашите финансиски вештини'
            ]),
            'fun_fact' => 'Истражувањата покажуваат дека луѓето кои имаат
            основно финансиско образование се повеќе склони кон финансиско
            планирање и штедење.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Финансиската независност се постигнува преку одговорно
            трошење, штедење и инвестирање. Клучот е во долгорочната дисциплина и планирање.',
            'learn_points' => json_encode([
                'Како да поставите цели за финансиска независност',
                'Стратегии за постигнување финансиска слобода',
                'Важноста на долгорочните финансиски планови'
            ]),
            'fun_fact' => 'Финансиската независност овозможува поголема
            флексибилност и слобода во животот, според експертите за лични финансии.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Следењето на вашите дневни и месечни трошоци е основа за подобро
            управување со личните финансии. Со редовна евиденција, можете да ги контролирате
            трошоците и да избегнете долгови.',
            'learn_points' => json_encode([
                'Зошто е важно да ги следите трошоците',
                'Како да креирате личен финансиски извештај',
                'Клучни совети за намалување на трошоци'
            ]),
            'fun_fact' => 'Според една анкета, 60% од луѓето не ги следат редовно своите
            трошоци и не знаат колку трошат месечно.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Поставувањето финансиски цели е клучен чекор кон остварување
            на вашите соништа. Јасните и измерливи цели ви даваат насока и мотивација
            да ги подобрите вашите финансии.',
            'learn_points' => json_encode([
                'Како да поставите реални финансиски цели',
                'Стратегии за остварување на краткорочни и долгорочни цели',
                'Мерење на напредокот кон финансиските цели'
            ]),
            'fun_fact' => 'Истражувањата покажуваат дека луѓето кои поставуваат конкретни
            финансиски цели имаат 50% поголема шанса да ги постигнат.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Осигурувањето претставува заштита за вашите финансии.
            Независно дали станува збор за здравствено, автомобилско или животно
            осигурување, тоа нуди безбедност во случај на непредвидливи настани.',
            'learn_points' => json_encode([
                'Видови на осигурувања и нивните придобивки',
                'Како да го изберете вистинското осигурување за вас',
                'Кои фактори треба да ги земете предвид при купување осигурување'
            ]),
            'fun_fact' => 'Само 50% од луѓето во светот имаат некаков вид на осигурување,
            според статистиките на глобалната осигурителна индустрија.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Користењето на финансиски алатки и апликации може да ви
            помогне да ги организирате и подобро управувате вашите финансии. Денешните
            технологии нудат брзи и лесни решенија за следење на трошоците.',
            'learn_points' => json_encode([
                'Најдобри апликации за следење на трошоци',
                'Како да ги користите технологиите за финансиско планирање',
                'Предности на дигиталното управување со финансии'
            ]),
            'fun_fact' => 'Според истражувањата, корисниците на финансиски апликации
            за следење на трошоци успеваат да заштедат до 15% повеќе отколку оние кои не ги користат.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Микроинвестирањето е одличен начин да започнете со градење
            на вашето богатство со мали суми. Со текот на времето, малите вложувања
            можат да растат и да станат значителен капитал.',
            'learn_points' => json_encode([
                'Што е микроинвестирање',
                'Кои платформи го поддржуваат микроинвестирањето',
                'Предности на микроинвестирањето за почетници'
            ]),
            'fun_fact' => 'Микроинвестирањето стана популарно во последните 10 години
            благодарение на новите дигитални платформи и апликации.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Финансиската дисциплина не значи само да штедите, туку и да
            ги оптимизирате вашите трошоци. Намалувањето на непотребните трошоци може
            да ви помогне да заштедите и инвестирање во она што е важно.',
            'learn_points' => json_encode([
                'Како да идентификувате непотребни трошоци',
                'Стратегии за подобрување на финансиската дисциплина',
                'Зошто е важно да се оптимизираат трошоците'
            ]),
            'fun_fact' => 'Луѓето кои редовно го прегледуваат својот буџет се 20% поуспешни
            во постигнувањето на нивните финансиски цели.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Инвестирањето во недвижности може да биде една од најбезбедните
            и најпрофитабилни опции на долг рок. Тоа нуди пасивен приход и можност за раст на капиталот.',
            'learn_points' => json_encode([
                'Зошто недвижностите се добра инвестиција',
                'Како да започнете со инвестирање во недвижности',
                'Предности и ризици при инвестирање во недвижности'
            ]),
            'fun_fact' => 'Истражувањата покажуваат дека цените на недвижностите глобално
            растат за околу 3-5% годишно.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Користењето на дебитни картички наместо кредитни ви
            помага да ги контролирате трошоците и да избегнете натрупување на
            долгови. Ова е одличен начин за финансиска дисциплина.',
            'learn_points' => json_encode([
                'Предности на дебитните картички',
                'Кои се главните разлики меѓу дебитна и кредитна картичка',
                'Како дебитната картичка ви помага да ги следите трошоците'
            ]),
            'fun_fact' => 'Истражувањата покажуваат дека 75% од младите луѓе
            преферираат користење на дебитни картички наместо кредитни.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Балансирањето помеѓу приходите и трошоците е основа
            за долгорочна финансиска стабилност. Со правилно планирање, можете
            да постигнете баланс и да избегнете финансиски стрес.',
            'learn_points' => json_encode([
                'Како да направите баланс помеѓу приходите и трошоците',
                'Зошто е важно да ги следите двете категории',
                'Како да го постигнете финансискиот баланс без жртвување на квалитетот на животот'
            ]),
            'fun_fact' => 'Истражувањата покажуваат дека луѓето кои одржуваат
            финансиски баланс имаат помалку долгови и поголема финансиска слобода.',
        ]);

        LecturePreview::create([
            'lecture_id' => 1,
            'content' => 'Вложувањето во сопственото образование секогаш дава
            најдобра исплата на долг рок. Дополнителното образование може да
            ви помогне да добиете подобра работа и да ги зголемите приходите.',
            'learn_points' => json_encode([
                'Зошто треба да инвестирате во вашето образование',
                'Како образованието влијае врз вашата финансиска состојба',
                'Кои типови на образование носат најголем финансиски поврат'
            ]),
            'fun_fact' => 'Истражувањата покажуваат дека луѓето со повисоко
            образование имаат 20% повисоки плати во просек.',
        ]);


    }
}
